#+BEGIN_EXPORT html
---
layout: page
title: SQLAlchemy
tagline: " features"
permalink: /python/sqlalchemy-features.html
categories: [SQLAlchemy, Python]
tags: [overview, features]
---
#+END_EXPORT
#+STARTUP: showall indent
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+PROPERTY: header-args :exports both
#+PROPERTY: header-args+ :results output pp
#+PROPERTY: header-args+ :eval no-export
#+PROPERTY: header-args+ :session sqlalchemy
#+PROPERTY: vizier-thread-id thread_SZn8OENkzkrgpweWP1ll6pj0
#+PROPERTY: vizier-assistant-id asst_9U8N72u9uVQesQNNjgOLJOu8
#+TOC: headlines 2

*** SQLAlchemy

Provide a complete Python code example using SQLAlchemy to implement a
one-to-many relationship between two tables, representing 'Author' and
'Book'. The 'Author' table should have multiple 'Book' entries
associated with it. The code should include model definitions, the
creation of the database, and examples of how to add and query
relationships.

Here is the enhanced question answered step-by-step with the code examples:

#+begin_src python
from sqlalchemy import create_engine, Column, Integer, String, ForeignKey
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import relationship, sessionmaker

# Create an engine and base
engine = create_engine('sqlite:///:memory:', echo=True)
Base = declarative_base()

# Define the Author model
class Author(Base):
    __tablename__ = 'authors'
    id = Column(Integer, primary_key=True)
    name = Column(String)
    books = relationship("Book", back_populates="author")

# Define the Book model
class Book(Base):
    __tablename__ = 'books'
    id = Column(Integer, primary_key=True)
    title = Column(String)
    author_id = Column(Integer, ForeignKey('authors.id'))
    author = relationship("Author", back_populates="books")

# Create the tables in the database
Base.metadata.create_all(engine)

# Create a session
Session = sessionmaker(bind=engine)
session = Session()

# Create an author
author = Author(name="J.K. Rowling")

# Create books associated with the author
book1 = Book(title="Harry Potter and the Philosopher's Stone", author=author)
book2 = Book(title="Harry Potter and the Chamber of Secrets", author=author)

# Add the author and books to the session and commit
session.add(author)
session.add(book1)
session.add(book2)
session.commit()

# Query to demonstrate the one-to-many relationship
authors = session.query(Author).all()
for author in authors:
    print(f"Author: {author.name}")
    for book in author.books:
        print(f"  - Book: {book.title}")
#+end_src

#+RESULTS:
#+begin_example
/tmp/babel-C8lSuP/python-JUVLiZ:7: MovedIn20Warning: The ``declarative_base()`` function is now available as sqlalchemy.orm.declarative_base(). (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  Base = declarative_base()
2024-07-22 19:26:18,499 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-07-22 19:26:18,499 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("authors")
2024-07-22 19:26:18,499 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-07-22 19:26:18,499 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("authors")
2024-07-22 19:26:18,499 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-07-22 19:26:18,499 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("books")
2024-07-22 19:26:18,500 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-07-22 19:26:18,500 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("books")
2024-07-22 19:26:18,500 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-07-22 19:26:18,500 INFO sqlalchemy.engine.Engine 
CREATE TABLE authors (
	id INTEGER NOT NULL, 
	name VARCHAR, 
	PRIMARY KEY (id)
)


2024-07-22 19:26:18,500 INFO sqlalchemy.engine.Engine [no key 0.00007s] ()
2024-07-22 19:26:18,501 INFO sqlalchemy.engine.Engine 
CREATE TABLE books (
	id INTEGER NOT NULL, 
	title VARCHAR, 
	author_id INTEGER, 
	PRIMARY KEY (id), 
	FOREIGN KEY(author_id) REFERENCES authors (id)
)


2024-07-22 19:26:18,501 INFO sqlalchemy.engine.Engine [no key 0.00008s] ()
2024-07-22 19:26:18,501 INFO sqlalchemy.engine.Engine COMMIT
2024-07-22 19:26:18,506 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-07-22 19:26:18,507 INFO sqlalchemy.engine.Engine INSERT INTO authors (name) VALUES (?)
2024-07-22 19:26:18,507 INFO sqlalchemy.engine.Engine [generated in 0.00015s] ('J.K. Rowling',)
2024-07-22 19:26:18,508 INFO sqlalchemy.engine.Engine INSERT INTO books (title, author_id) VALUES (?, ?) RETURNING id
2024-07-22 19:26:18,508 INFO sqlalchemy.engine.Engine [generated in 0.00014s (insertmanyvalues) 1/2 (ordered; batch not supported)] ("Harry Potter and the Philosopher's Stone", 1)
2024-07-22 19:26:18,508 INFO sqlalchemy.engine.Engine INSERT INTO books (title, author_id) VALUES (?, ?) RETURNING id
2024-07-22 19:26:18,509 INFO sqlalchemy.engine.Engine [insertmanyvalues 2/2 (ordered; batch not supported)] ('Harry Potter and the Chamber of Secrets', 1)
2024-07-22 19:26:18,509 INFO sqlalchemy.engine.Engine COMMIT
2024-07-22 19:26:18,510 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-07-22 19:26:18,510 INFO sqlalchemy.engine.Engine SELECT authors.id AS authors_id, authors.name AS authors_name 
FROM authors
2024-07-22 19:26:18,510 INFO sqlalchemy.engine.Engine [generated in 0.00011s] ()
Author: J.K. Rowling
2024-07-22 19:26:18,513 INFO sqlalchemy.engine.Engine SELECT books.id AS books_id, books.title AS books_title, books.author_id AS books_author_id 
FROM books 
WHERE ? = books.author_id
2024-07-22 19:26:18,513 INFO sqlalchemy.engine.Engine [generated in 0.00014s] (1,)
  - Book: Harry Potter and the Philosopher's Stone
  - Book: Harry Potter and the Chamber of Secrets
#+end_example


*Explanation:*

1. *Model Definitions:*
   - *Author Model:* Represents the 'authors' table with an ~id~
     primary key and a ~name~ field. It has a relationship with the
     ~Book~ model specified by ~books~.
   - *Book Model:* Represents the 'books' table with an ~id~ primary
     key, a ~title~ field, and a ~author_id~ foreign key pointing to
     ~authors.id~. It has a relationship with the ~Author~ model
     specified by ~author~.

2. *Relationships:*
   - ~relationship("Book", back_populates="author")~ in the ~Author~
     model defines a one-to-many relationship where each author can
     have multiple books.
   - ~relationship("Author", back_populates="books")~ in the ~Book~
     model defines the inverse of this relationship.

3. *Database Creation:*
   - ~Base.metadata.create_all(engine)~ creates the 'authors' and
     'books' tables in the SQLite in-memory database.

4. *Data Insertion:*
   - An ~Author~ object is created.
   - Two ~Book~ objects are created with the ~author~ attribute set to
     the previously created ~Author~ object.

5. *Session Commit:*
   - The ~author~ and books are added to the session and committed to
     the database.

6. *Querying:*
   - Queries all authors and prints their names and associated books,
     demonstrating the one-to-many relationship.

This example provides a comprehensive way to implement and demonstrate
a one-to-many relationship using SQLAlchemy.

*** Pure Python
*Task Description:*

Provide a complete Python code example using ~sqlite3~ module from
the standard library to alter the ~books~ table by adding two
additional columns: ~publisher~ and ~publication_year~. The code
should include the initial table creation, the alteration to add new
columns, and examples of populating and querying the updated table.

-----

Certainly! Here is a complete Python code example that demonstrates
how to use the ~sqlite3~ module from the standard library to implement
the following:

1. Initial table creation for ~Author~ and ~Book~ tables.
2. Altering the ~books~ table to add two additional columns:
   ~publisher~ and ~publication_year~.
3. Adding new data to the updated table.
4. Querying data from the updated table.

#+begin_src python
import sqlite3

# Connect to SQLite database (or create it if it doesn't exist)
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Enable foreign key support
cursor.execute("PRAGMA foreign_keys = ON")

# Create the Author table
cursor.execute("""
CREATE TABLE Author (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL
)
""")

# Create the Book table with initial columns
cursor.execute("""
CREATE TABLE Book (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    title TEXT NOT NULL,
    author_id INTEGER,
    FOREIGN KEY (author_id) REFERENCES Author (id)
)
""")

# Insert data into Author table
cursor.execute("INSERT INTO Author (name) VALUES ('J.K. Rowling')")
author_id = cursor.lastrowid

# Insert data into Book table
cursor.execute("INSERT INTO Book (title, author_id) VALUES (?, ?)",
               ("Harry Potter and the Philosopher's Stone", author_id))

# Commit the transaction
conn.commit()

# Alter the table to add new columns
cursor.execute("ALTER TABLE Book ADD COLUMN publisher TEXT")
cursor.execute("ALTER TABLE Book ADD COLUMN publication_year INTEGER")

# Insert additional data with new columns into Book table
cursor.execute("INSERT INTO Book (title, author_id, publisher, publication_year) VALUES (?, ?, ?, ?)",
               ("Harry Potter and the Chamber of Secrets", author_id, "Bloomsbury", 1998))

# Commit the transaction
conn.commit()

# Query and display books along with the new columns
cursor.execute("""
SELECT 
    Author.name AS author_name, 
    Book.title AS book_title,
    Book.publisher AS publisher,
    Book.publication_year AS publication_year
FROM 
    Book
JOIN 
    Author ON Book.author_id = Author.id
""")

results = cursor.fetchall()
for row in results:
    print(
        f"Author: {row[0]} - Book: {row[1]} - Publisher: {row[2]} - Publication Year: {row[3]}")

# Close the connection
conn.close()
#+end_src

#+RESULTS:
: Author: J.K. Rowling - Book: Harry Potter and the Philosopher's Stone - Publisher: None - Publication Year: None
: Author: J.K. Rowling - Book: Harry Potter and the Chamber of Secrets - Publisher: Bloomsbury - Publication Year: 1998

*Explanation:*

1. *Database Connection:*
   - ~conn = sqlite3.connect(':memory:')~ creates a connection to an
     in-memory SQLite database for testing purposes. To use a
     persistent database, replace ~:memory:~ with a file name like
     ~'example.db'~.

2. *Table Creation:*
   - The ~Author~ table is created with an ~id~ primary key and ~name~
     field.
   - The ~Book~ table is initially created with an ~id~ primary key,
     ~title~, and ~author_id~ as a foreign key referencing ~Author~.

3. *Data Insertion:*
   - An author named "J.K. Rowling" is inserted into the ~Author~
     table.
   - A book titled "Harry Potter and the Philosopher's Stone" is
     inserted into the ~Book~ table with the foreign key ~author_id~.

4. *Table Alteration:*
   - The ~ALTER TABLE~ statements add two new columns: ~publisher~
     (TEXT) and ~publication_year~ (INTEGER) to the ~Book~ table.

5. *Inserting Data to Updated Table:*
   - Another book titled "Harry Potter and the Chamber of Secrets" is
     inserted with values for the new columns: ~publisher~ and
     ~publication_year~.

6. *Querying Data:*
   - A JOIN query fetches and displays author names, book titles,
     publishers, and publication years to verify the changes.

7. *Close Connection:*
   - The connection to the SQLite database is closed to release
     resources.

This example shows how to manage schema evolution in SQLite using the
~sqlite3~ standard library module in Python.


